app/Http/Controllers/HomeController.php

select count(*) as aggregate from `history_orders` where `id_order_status` = 3
select count(*) as aggregate from `history_orders` where `id_order_status` = 4
select count(*) as aggregate from `history_orders` where `id_order_status` = 8 and `status` = 1
select count(*) as aggregate from `history_orders` where `id_order_status` = 9 and `status` = 0
select count(*) as aggregate from `history_orders` where `id_order_status` = 2 and `status` = 1
select count(*) as aggregate from `history_orders` where `id_order_status` = 10
select `id_category`, `name_category` from `categories` where `categories`.`id_category` in (1, 2, 3, 4, 5)
select `id_product`, `id_type_unit`, `id_category`, `name_product`, `type_price`, `price`, `weight`, `volume`, `product_status` from `products` order by `product_status` desc
select `id_type_unit`, `type_unit` from `type_units` where `type_units`.`id_type_unit` in (1, 2, 3, 4)
---
    public function index()
    {


        $providers=Provider::GetCantidades();

        $num_pre = DB::table('history_orders')->where('id_order_status', 3)->count();
        $num_com = DB::table('history_orders')->where('id_order_status', 4)->count();
        $num_agen = DB::table('history_orders')->where('id_order_status', 8)->where('status', 1)->count();
        $num_ent = DB::table('history_orders')->where('id_order_status', 9)->where('status', 0)->count();
        $num_cot = DB::table('history_orders')->where('id_order_status', 2)->where('status', 1)->count();
        $num_fact = DB::table('history_orders')->where('id_order_status', 10)->count();


        $orders = $this->repository->getOrders();
        $products = Product::with('typeUnit:id_type_unit,type_unit', 'category:id_category,name_category', 'priceActive:id_price,price,id_product')
            ->orderBy('product_status', 'DESC')
            ->get(['id_product', 'id_type_unit', 'id_category', 'name_product', 'type_price', 'price', 'weight', 'volume', 'product_status']);

select `u`.`id`, `a`.`first_name`, `a`.`last_name`, `a`.`contact_number`, `a`.`address`, `u`.`email`, `r`.`name` from `drivers` as `a` inner join `users` as `u` on `u`.`usable_id` = `a`.`nid_driver` inner join `role_user` as `rs` on `rs`.`user_id` = `u`.`id` inner join `roles` as `r` on `rs`.`role_id` = `r`.`id`
---
    public function getPerfil($id){
        $type=User::find($id);
        if($type->type_user==1){
            $tipo=1;
            $user = DB::table('admins as a')
            ->join('users as u', 'u.usable_id', '=', 'a.id_admin')
            ->join('role_user as rs', 'rs.user_id', '=', 'u.id')
            ->join('roles as r', 'rs.role_id', '=', 'r.id')
            ->select('u.id','a.first_name', 'a.last_name', 'a.document', 'a.address','u.email', 'r.name')

            ->get();
            return response()->view('ajax.perfil', compact('user', 'tipo'));
        }

        if($type->type_user==3){
            $tipo=3;
            $user = DB::table('drivers as a')
            ->join('users as u', 'u.usable_id', '=', 'a.nid_driver')
            ->join('role_user as rs', 'rs.user_id', '=', 'u.id')
            ->join('roles as r', 'rs.role_id', '=', 'r.id')
            ->select('u.id','a.first_name', 'a.last_name', 'a.contact_number', 'a.address','u.email', 'r.name')

            ->get();