app/Http/Controllers/OrderController.php

update `order_schedules` set `status` = 0 where `id_order` = '24' and `status` = 1
---
            $order->observation=$request->observation1;
            $order->save();

            $history =  DB::table('order_schedules')->where('id_order',$request->order_id)
            ->where('status', 1)->update(['status' => 0])  ;

update `history_orders` set `status` = 0, `history_orders`.`updated_at` = '2020-07-18 10:42:19' where `id_order` = '24' and `id_order_status` = 11
---
            $history->status=1;
            $history->save();

            $history = HistoryOrder::where('id_order',$request->order_id)
            ->where('id_order_status', 11)->update(['status' => 0])  ;

insert into `history_orders` (`id_order`, `id_order_status`, `observation`, `status`, `updated_at`, `created_at`) values ('34', 9, 'Entregado', 1, '2020-07-20 12:48:08', '2020-07-20 12:48:08')
---
    public function saveInvoice(Request $request){

        $fecha = Carbon::now()->format('Y-m-d');
        if($request->date < $fecha){
            return response()->json(['warning' => 'La Fecha No Puede ser Menor a la Fecha Actual']);
        }
        DB::beginTransaction();
        try {
        $order= new OrderInvoice();
        $order->id_order=$request->id_order;
        $order->id_admin=$request->id_admin;
        $order->type=$request->type;
        $order->total=$request->total;
        $order->descuento=$request->discount;
        $order->valor=$request->total_fact;
        $order->date=$request->date;
        $order->observation=$request->observation;
        $order->save();

        $history = HistoryOrder::where('id_order',$request->id_order)
        ->where('id_order_status', 9)->update(['status' => 0])  ;


        $history = new  HistoryOrder();
        $history->id_order=$request->id_order;
        $history->id_order_status=10;
        $history->observation='Facturado';
        $history->status=1;
        $history->save();

select * from `history_orders` where `id_order` = '23'
select * from `order_invoices` where `id_order` = '23'
---
    public function getOrder($id)
    {

       $order = $this->repository->findByIdWithDetails($id);
        $direccionF=Order::find($id)->address_invoice;
        $histories=HistoryOrder::where('id_order', $id)->get();
        $entregas=DB::select("SELECT osd.placa, CONCAT(d.first_name,' ',d.last_name) AS conductor, deo.date, deo.hour  FROM order_schedules os
        INNER JOIN order_schedule_details osd ON os.id_order_schedule=osd.id_order_schedule
        INNER JOIN drivers d ON d.nid_driver=osd.nid_driver
        INNER JOIN deliveries_orders deo ON deo.id_order=os.id_order
        WHERE deo.`status`<=3 and os.id_order=?", [$id]);
        $fecha = Carbon::now()->format('d-m-Y');
        $factura=OrderInvoice::where('id_order', $id)->get();

select * from `order_schedules` where `id_order` = '19'
select * from `order_schedule_details` where `id_order_schedule` = 15
---
    public function editSchedule($id){

        $schedule=OrderSchedule::where('id_order',$id)->get();

        $vehicles = $this->repository->getVehiclesActiveWithDriver();
        $details=OrderScheduleDetail::where('id_order_schedule', $schedule[0]->id_order_schedule)->get();

update `order_schedules` set `date_departure` = '2020-07-18', `time_departure` = '11:55:00', `order_schedules`.`updated_at` = '2020-07-16 10:35:39' where `id_order` = '17'
select * from `order_schedules` where `id_order` = '4'
select * from `order_schedule_details` where `id_order_schedule` = 19
---
    public function updateSchedule(Request $request){


            $drivers=$request->driver;
            $id_details=$request->id_order_schedule_details;



            DB::beginTransaction();
            try {
            $exito = OrderSchedule::where('id_order',$request->id_order)
                ->update(['date_departure' => $request->date_departure, 'time_departure'=>$request->time_departure])  ;

            for($i=0; $i<count($drivers); $i++){
                if($drivers[$i]==0){

                }else {
                    $partes = explode("-", $drivers[$i]);
                    $placa=$partes[0];
                    $nid_driver=$partes[1];
                    $detail=OrderScheduleDetail::find($id_details[$i]);