app/Http/Controllers/OrderStatusController.php

select * from `order_status`
---
    public function index()
    {
        $orderstatus = OrderStatus::all();