app/Http/Controllers/OrderController.php

    public function history($id)
    {
        $fecha = Carbon::now()->format('d-m-Y');
        $histories = HistoryOrder::where('id_order', $id)->get();
---
select * from `history_orders` where `id_order` = '30'

    public function create(Request $request)
    {
        $porcentages=Porcentage::all();
---
select * from `porcentages`

    public function store(OrderRequest $request)
    {
        if (request()->ajax()) {
            $order = new Order;
            $order = $this->createObjectOrder($request, $order);
            DB::beginTransaction();
            try {
                $order->save();
---
insert into `orders` (`id_customer_domicile`, `id_type_payment`, `id_time_payment`, `date_order`, `priority`, `address_invoice`, `type_invoice`, `updated_at`, `created_at`) values ('76', '1', '1', '2020-07-20 10:15:12', '1', '', '2', '2020-07-20 10:15:12', '2020-07-20 10:15:12')

    public function storeHystoryOrder($order)
    {
        $order_status = OrderStatus::where('name', 'Pre-Orden')->first();
---
select * from `order_status` where `name` = 'Pre-Orden' limit 1

    public function edit($id)
    {
        $order = Order::findById($id)->with('orderDetails.product:id_product,name_product')->first();
        $customers = Customer::all(['nid', 'first_name', 'last_name', 'full_name']);
        $departaments = Departament::with('municipalities')->get();
        $typepayments = TypePayment::all(['id_type_payment', 'type_payment', 'description']);
        $timepayments = TimePayment::all(['id_time_payment', 'time_payment', 'description']);
        $products = Product::with('priceActive:id_price,price,id_product')->get(['id_product', 'name_product', 'price', 'type_price']);
---
select `id_product`, `name_product` from `products` where `products`.`id_product` in (21)
select `nid`, `first_name`, `last_name`, `full_name` from `customers`
select * from `departaments`
select `id_type_payment`, `type_payment`, `description` from `type_payments`
select `id_time_payment`, `time_payment`, `description` from `time_payments`
select `id_product`, `name_product`, `price`, `type_price` from `products`

    public function clonar($id)
    {

        $order = Order::findById($id)->with('orderDetails.product:id_product,name_product')->first();
        $customers = Customer::all(['nid', 'first_name', 'last_name', 'full_name']);
        $departaments = Departament::with('municipalities')->get();
        $typepayments = TypePayment::all(['id_type_payment', 'type_payment', 'description']);
        $timepayments = TimePayment::all(['id_time_payment', 'time_payment', 'description']);
        $products = Product::with('priceActive:id_price,price,id_product')->get(['id_product', 'name_product', 'price', 'type_price']);
---
select `id_product`, `name_product` from `products` where `products`.`id_product` in (21)
select `nid`, `first_name`, `last_name`, `full_name` from `customers`
select * from `departaments`
select `id_type_payment`, `type_payment`, `description` from `type_payments`
select `id_time_payment`, `time_payment`, `description` from `time_payments`
select `id_product`, `name_product`, `price`, `type_price` from `products`

    public function changeMunicipalities($id)
    {
        if (request()->ajax()) {
            $departament = Departament::with('municipalities')->where('id_departament', $id)->first();
---
select * from `departaments` where `departaments`.`id_departament` in (1)

    public function changeDomiciles($id)
    {

        if (request()->ajax()) {
            $customer = Customer::where('nid', $id)->with('domicileCurrent.municipality.departament')->first();

            $order = Order::latest()->first(['id_order']);
---
select * from `customers` where `nid` = '6455555' limit 1
select `id_order` from `orders` order by `created_at` desc limit 1

    public function saveEntregas(Request $request){

        DB::beginTransaction();
        try {
        if($request->status==3){
            $order= new OrderDelivery();
            $order->id_order=$request->id_order;
            $order->status=$request->status;
            $order->date=$request->date;
            $order->hour=$request->hour;
            $order->weight=$request->weight;
            $order->observation=$request->observation;
            $order->save();

            $history = HistoryOrder::where('id_order',$request->id_order)
            ->where('id_order_status', 8)->update(['status' => 0])  ;

            $history = new  HistoryOrder();
            $history->id_order=$request->id_order;
            $history->id_order_status=11;
            $history->observation='Proceso de Entrega';
            $history->status=1;
            $history->save();
---
update `history_orders` set `status` = 0, `history_orders`.`updated_at` = '2020-07-20 11:16:59' where `id_order` = '32' and `id_order_status` = 8
insert into `history_orders` (`id_order`, `id_order_status`, `observation`, `status`, `updated_at`, `created_at`) values ('36', 11, 'Proceso de Entrega', 1, '2020-07-20 13:12:49', '2020-07-20 13:12:49')

                return response()->json(['warning' => 'CAMPO CANTIDAD/PESO ESTA VACIO']);
            }
            //OBTENER EL PRODUCTO ID
            $resul=OrderDetail::where('id_order', $request->order_id)
            ->where('id_product', $request->id_product)
            ->first();
---
select * from `order_details` where `id_order` = '34' and `id_product` = '17' limit 1

            if($request->status1==2){

                $order->save();
                $schedule=OrderSchedule::where('id_order', $request->order_id)->get();
                $history = OrderScheduleDetail::where('id_order_schedule', $schedule[0]->id_order_schedule)
                ->where('placa', $request->placa)->where('nid_driver', $request->nid_driver)->update(['status' => 1])  ;
---
select * from `order_schedules` where `id_order` = '37'
update `order_schedule_details` set `status` = 1, `order_schedule_details`.`updated_at` = '2020-07-20 13:51:29' where `id_order_schedule` = 38 and `placa` = 'LEI654' and `nid_driver` = '1103123456'

                $history->observation='Entregado';
                $history->status=1;
                $history->save();
                $schedule=OrderSchedule::where('id_order', $request->order_id)->get();


                $update = OrderScheduleDetail::where('id_order_schedule', $schedule[0]->id_order_schedule)
                ->where('placa', $request->placa)->where('nid_driver', $request->nid_driver)->update(['status' => 1])  ;

                    if($request->cerrar==1){
                        $history =  DB::table('order_schedules')->where('id_order',$request->order_id)
                        ->where('status', 1)->update(['status' => 0])  ;

                        $history = HistoryOrder::where('id_order',$request->order_id)
                    ->where('id_order_status', 11)
                    ->orWhere('id_order_status', 14)
                    ->update(['status' => 0])  ;
---
select * from `order_schedules` where `id_order` = '37'
update `order_schedules` set `status` = 0 where `id_order` = '28' and `status` = 1
update `order_schedule_details` set `status` = 1, `order_schedule_details`.`updated_at` = '2020-07-20 13:55:46' where `id_order_schedule` = 38 and `placa` = 'LEI654' and `nid_driver` = '1103123456'
update `order_schedules` set `status` = 0 where `id_order` = '34' and `status` = 1
update `history_orders` set `status` = 0, `history_orders`.`updated_at` = '2020-07-20 12:48:08' where `id_order` = '34' and `id_order_status` = 11 or `id_order_status` = 14

                    ->sum('weight');


                    $det=OrderDetail::where('id_order', $request->order_id)
                    ->where('id_product', $request->id_product)->get();
---
select * from `order_details` where `id_order` = '34' and `id_product` = '17'

    public function getOrder($id)
    {

       $order = $this->repository->findByIdWithDetails($id);
        $direccionF=Order::find($id)->address_invoice;
        $histories=HistoryOrder::where('id_order', $id)->get();
        $entregas=DB::select("SELECT osd.placa, CONCAT(d.first_name,' ',d.last_name) AS conductor, deo.date, deo.hour  FROM order_schedules os
        INNER JOIN order_schedule_details osd ON os.id_order_schedule=osd.id_order_schedule
        INNER JOIN drivers d ON d.nid_driver=osd.nid_driver
        INNER JOIN deliveries_orders deo ON deo.id_order=os.id_order
        WHERE deo.`status`<=3 and os.id_order=?", [$id]);
        $fecha = Carbon::now()->format('d-m-Y');
        $factura=OrderInvoice::where('id_order', $id)->get();
---
select * from `history_orders` where `id_order` = '13'
select * from `order_invoices` where `id_order` = '13'

    public function editSchedule($id){

        $schedule=OrderSchedule::where('id_order',$id)->get();

        $vehicles = $this->repository->getVehiclesActiveWithDriver();
        $details=OrderScheduleDetail::where('id_order_schedule', $schedule[0]->id_order_schedule)->get();
---
select * from `order_schedules` where `id_order` = '29'
select * from `order_schedule_details` where `id_order_schedule` = 26