app/Http/Controllers/ProductController.php

    public function create()
    {
        $categories = Category::all(['id_category', 'name_category', 'description']);
        $typeunits = TypeUnit::all(['id_type_unit', 'type_unit', 'description']);
---
select `id_category`, `name_category`, `description` from `categories`
select `id_type_unit`, `type_unit`, `description` from `type_units`

    public function consultar($id)
    {
        if (request()->ajax()) {
            $order = $this->repository->findWithDetails($id);
            $vehicles = DB::table('order_schedules as os')
            ->join('order_schedule_details as osd', 'os.id_order_schedule', '=','osd.id_order_schedule')
            ->select('osd.placa', 'osd.nid_driver')
            ->where('os.id_order', $id)
            ->get();
---
select `osd`.`placa`, `osd`.`nid_driver` from `order_schedules` as `os` inner join `order_schedule_details` as `osd` on `os`.`id_order_schedule` = `osd`.`id_order_schedule` where `os`.`id_order` = '19'

    public function saveCarga(Request $request){

        $products=$request->product_id;
        for($i=0; $i<count($products); $i++){
            $load = new Load();
            $load->id_order=$request->id_order;
            $load->id_product=$products[$i];
            $load->amount=$request->amount[$i];
            $partes = explode("-", $request->vehicle[$i]);

            $load->placa=$partes[0];
            $load->nid_driver=$partes[1];
            $load->save();
---
insert into `loads` (`id_order`, `id_product`, `amount`, `placa`, `nid_driver`, `updated_at`, `created_at`) values ('1', '7', '10', 'LEI654', '1103123456', '2020-07-19 22:55:24', '2020-07-19 22:55:24')

    public function getProductos(Request $request){
        $id=$request->id;
        $placa=$request->placa;
        $nid=$request->nid;
        $products=DB::table('loads as l')
        ->join('products as p', 'l.id_product', '=', 'p.id_product')
        ->select('p.id_product', 'p.name_product')
        ->where('l.id_order', $id)
        ->where('l.placa', $placa)
        ->where('l.nid_driver', $nid)
        ->get();
---
select `p`.`id_product`, `p`.`name_product` from `loads` as `l` inner join `products` as `p` on `l`.`id_product` = `p`.`id_product` where `l`.`id_order` = '34' and `l`.`placa` = 'LEI654' and `l`.`nid_driver` = '1103123456'