app/Http/Controllers/ProviderController.php

    public function index()
    {
        $providers = Provider::with('typeProvider')
            ->orderBy('provider_status', 'DESC')
            ->get(['nit', 'id_type_provider', 'full_name', 'first_name', 'last_name', 'provider_status']);
---
select `nit`, `id_type_provider`, `full_name`, `first_name`, `last_name`, `provider_status` from `providers` order by `provider_status` desc

    public function create()
    {
        $typeproviders = TypeProvider::all();
        $municipalities = Municipality::with('departament')->get();
---
select * from `type_providers`
select * from `municipalities`

    public function edit($id)
    {
        $provider = Provider::findOrFail($id);
        $typeproviders = TypeProvider::all();
        $municipalities = Municipality::with('departament')->get();
---
select * from `type_providers`
select * from `municipalities`

    public function changeStatus($id)
    {
        $provider = Provider::findOrFail($id);
        if ($provider->provider_status) {
            $provider->update(['provider_status' => 0]);
---
update `providers` set `provider_status` = 0, `providers`.`updated_at` = '2020-07-20 20:58:22' where `nit` = 11028687905