app/Http/Controllers/TimePaymentController.php

    public function index()
    {
        $timepayments = TimePayment::all();
---
select * from `time_payments`