app/Http/Controllers/VehicleController.php

    public function index()
    {
        $vehicles = Vehicle::all();
---
select * from `vehicles`