app/Models/DriverVehicle.php

select distinct `dv`.`placa`, `dv`.`nid_driver`, `d`.`first_name`, `d`.`last_name` from `driver_vehicle` as `dv` inner join `drivers` as `d` on `dv`.`nid_driver` = `d`.`nid_driver`
---
    public static function DriverVehicle()
    {
        return DB::table('driver_vehicle as dv')->join('drivers as d', 'dv.nid_driver', '=', 'd.nid_driver')

            ->select(
                'dv.placa',
                'dv.nid_driver',
                'd.first_name',
                'd.last_name'
            )->distinct()->get();