app/Models/OrderDetail.php

select `p`.`id_product`, `p`.`name_product` from `orders` as `o` inner join `order_details` as `od` on `o`.`id_order` = `od`.`id_order` inner join `products` as `p` on `od`.`id_product` = `p`.`id_product` where `o`.`id_order` = '27'
---
    public static function getProductsOrder($id){
        return DB::table('orders as o')
        ->join('order_details as od', 'o.id_order', '=', 'od.id_order')
        ->join('products as p', 'od.id_product', '=', 'p.id_product')
        ->select('p.id_product', 'p.name_product')
        ->where('o.id_order', $id)
        ->get();