app/Models/Provider.php

select `pro`.`full_name`, count(*) as cantidad from `providers` as `pro` inner join `purchase_order_details` as `p` on `p`.`nit` = `pro`.`nit` group by `p`.`nit`
---
    public static function GetCantidades(){
        $users = DB::table('providers as pro')
        ->join('purchase_order_details as p', 'p.nit', '=', 'pro.nit')
        ->select('pro.full_name', DB::raw('count(*) as cantidad'))
        ->groupBy('p.nit')->get();