app/Repositories/CustomerRepository.php

select `nid`, `full_name`, `first_name`, `last_name`, `email` from `customers` order by `created_at` desc
---
    public function getCustomers()
    {
        return Customer::latest()->get(['nid', 'full_name', 'first_name', 'last_name', 'email']);

select `id_departament`, `name_departament` from `departaments`
---
    public function getDepartaments()
    {
        return Departament::all(['id_departament', 'name_departament']);

select `id_municipality`, `name_municipality`, `id_departament` from `municipalities`
---
    public function getMunicipalities()
    {
        return Municipality::all(['id_municipality', 'name_municipality', 'id_departament']);

select `id_type_customer`, `type_customer`, `description` from `type_customers`
---
    public function getTypeCustomers()
    {
        return TypeCustomer::all(['id_type_customer', 'type_customer', 'description']);