app/Repositories/OrderRepository.php

select `nid`, `first_name`, `last_name`, `full_name` from `customers`
---
    public function getCustomers()
    {
        return Customer::all(['nid', 'first_name', 'last_name', 'full_name']);

select `id_type_customer`, `type_customer`, `description` from `type_customers`
---
    public function getTypeCustomers()
    {
        return TypeCustomer::all(['id_type_customer', 'type_customer', 'description']);

select `id_departament`, `name_departament` from `departaments`
---
    public function getDepartaments()
    {
        return Departament::all(['id_departament', 'name_departament']);

select `id_municipality`, `name_municipality`, `id_departament` from `municipalities`
---
    public function getMunicipalities()
    {
        return Municipality::all(['id_municipality', 'name_municipality', 'id_departament']);

select `id_type_payment`, `type_payment`, `description` from `type_payments`
---
    public function getTypePayments()
    {
        return TypePayment::all(['id_type_payment', 'type_payment', 'description']);

select `id_time_payment`, `time_payment`, `description` from `time_payments`
---
    public function getTimesPayments()
    {
        return TimePayment::all(['id_time_payment', 'time_payment', 'description']);

select `id_product`, `name_product`, `price`, `type_price`, `id_type_unit` from `products`
---
    public function getProducts()
    {
        return Product::with('priceActive:id_price,price,id_product')->get(['id_product', 'name_product', 'price', 'type_price', 'id_type_unit']);

select * from `type_units` where `type_units`.`id_type_unit` in (4)
select `id_product`, `name_product`, `id_type_unit` from `products` where `products`.`id_product` in (20)
---
    public function findByIdWithDetails($id)
    {
        return Order::findById($id)->with('orderDetails.product:id_product,name_product,id_type_unit', 'orderDetails.product.typeUnit')->first();

select * from `order_details` where `order_details`.`id_order` in (23)
select * from `type_units` where `type_units`.`id_type_unit` in (4)
select `id_order` from `orders` where `id_order` = '23' limit 1
select `id_product`, `name_product`, `id_type_unit` from `products` where `products`.`id_product` in (20, 21)
---
    public function findWithDetails($id)
    {
        return Order::where('id_order', $id)->with('orderDetails.product:id_product,name_product,id_type_unit', 'orderDetails.product.typeUnit')->first(['id_order']);

select * from `history_orders` where `history_orders`.`id_order` in (41)
select `id_order` from `orders` where `id_order` = '41' limit 1
---
    public function findByIdWithHistoriesStatus($id)
    {
        return Order::where('id_order', $id)->with('historyOrders.orderStatus')->first(['id_order']);

select * from `order_details` where `order_details`.`id_order` in (20)
select * from `type_units` where `type_units`.`id_type_unit` in (2, 4)
select `id_order` from `orders` where `id_order` = '20' limit 1
select `id_product`, `name_product`, `id_type_unit` from `products` where `products`.`id_product` in (21, 22)
---
    public function findWithProviders($id)
    {
        return Order::where('id_order', $id)
            ->with(
                'orderDetails.product:id_product,name_product,id_type_unit',
                'orderDetails.product.typeUnit',
                'orderDetails.providers.municipality.departament')
            ->first(['id_order']);

update `history_orders` set `status` = 0, `updated_at` = '2020-07-20 15:48:05' where `id_order` = 41 and `id_order_status` in (3)
select * from `order_status` where `name` = 'Agendado' limit 1
insert into `history_orders` (`created_at`, `id_order`, `id_order_status`, `observation`, `status`, `updated_at`) values ('2020-07-20 15:48:05', 41, 8, 'Agendado', 1, '2020-07-20 15:48:05')
---
    public function updateStatusOrder($order, $status)
    {
        foreach ($order->historyOrders as $history) {
            $order->orderStatus()->updateExistingPivot($history->id_order_status, ['status' => 0]);
        }

        $order_status = OrderStatus::where('name', $status)->first();
        $order->orderStatus()->attach($order_status->id_order_status, ['observation' => $status, 'status' => 1]);

update `orders` set `discount` = '25000', `orders`.`updated_at` = '2020-07-18 10:05:06' where `id_order` = 23
---
    public function saveDiscount($request)
    {
        $order = $this->findById($request->id_order);
        $order->discount = $request->discount;

        return $order->save();

insert into `order_schedules` (`id_order`, `description`, `date_departure`, `time_departure`, `status`, `updated_at`, `created_at`) values ('41', 'ery', '2020-07-20', '15:47', 1, '2020-07-20 15:48:05', '2020-07-20 15:48:05')
---
    public function saveSchedule($order, $request)
    {

        $schedule = new OrderSchedule;

        $schedule = $this->createObjectSchedule($request, $schedule);

        DB::beginTransaction();
        try {

            $schedule->save();